window.ANATOMY_DATA = {
  "regions": [
    {
      "id": "hand",
      "name": "手",
      "views": [
        {
          "id": "hand-back",
          "label": "手背照片",
          "image": "images/03-hand-back.jpeg",
          "w": 640,
          "h": 579,
          "crop": {
            "x": 18,
            "y": 6,
            "w": 56,
            "h": 90
          },
          "points": [
            {
              "x": 46.15,
              "y": 13.76,
              "name": "桡骨茎突"
            },
            {
              "x": 39.6,
              "y": 14.06,
              "name": "腕骨"
            },
            {
              "x": 33.36,
              "y": 15.8,
              "name": "腕关节"
            },
            {
              "x": 26.45,
              "y": 20.05,
              "name": "尺骨茎突"
            },
            {
              "x": 72.91,
              "y": 21.81,
              "name": "掌指关节"
            },
            {
              "x": 61.19,
              "y": 24.59,
              "name": "虎口腹凸"
            },
            {
              "x": 32.9,
              "y": 37.02,
              "name": "小指球"
            },
            {
              "x": 52.44,
              "y": 37.58,
              "name": "掌骨头"
            },
            {
              "x": 39.86,
              "y": 39.19,
              "name": "指总伸肌腱"
            },
            {
              "x": 35.49,
              "y": 68.14,
              "name": "指指关节"
            },
            {
              "x": 64.13,
              "y": 71.7,
              "name": "指骨底"
            },
            {
              "x": 65.3,
              "y": 84.02,
              "name": "指骨滑车"
            }
          ]
        },
        {
          "id": "hand-views",
          "label": "手部多视图练习",
          "image": "images/47-hand-views-learn.jpeg",
          "w": 1024,
          "h": 768,
          "editImage": "images/64-hand-views-edit.jpeg",
          "editW": 762,
          "editH": 574,
          "practiceImage": "images/47-hand-views-learn.jpeg",
          "practiceW": 1024,
          "practiceH": 768,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "name": "掌骨头(背侧)",
              "x": 18.1,
              "y": 15.9
            },
            {
              "name": "指骨底(背侧)",
              "x": 15.2,
              "y": 17.1
            },
            {
              "name": "桡骨茎突(背侧)",
              "x": 28.8,
              "y": 16.7
            },
            {
              "name": "腕骨",
              "x": 33.9,
              "y": 21.8
            },
            {
              "name": "小指球",
              "x": 35.7,
              "y": 35.8
            },
            {
              "name": "指骨底(小指侧)",
              "x": 12,
              "y": 30.2
            },
            {
              "name": "指骨滑车",
              "x": 15.09,
              "y": 27.28
            },
            {
              "name": "掌长肌腱沟",
              "x": 68.36,
              "y": 18.26
            },
            {
              "name": "小指球(掌侧)",
              "x": 80.9,
              "y": 15.2
            },
            {
              "name": "桡骨茎突(掌侧)",
              "x": 66.28,
              "y": 24.04
            },
            {
              "name": "拇指球",
              "x": 73.01,
              "y": 33.99
            },
            {
              "name": "掌心窝",
              "x": 78.94,
              "y": 27.81
            },
            {
              "name": "掌指关节弓形凸",
              "x": 83.64,
              "y": 32.46
            },
            {
              "name": "掌骨底(侧面)",
              "x": 12.09,
              "y": 84.32
            },
            {
              "name": "拇长展肌腱(侧面)",
              "x": 11.65,
              "y": 88.68
            },
            {
              "name": "桡骨茎突(侧面)",
              "x": 16.17,
              "y": 93.22
            },
            {
              "name": "拇长伸肌腱",
              "x": 18.26,
              "y": 86.69
            },
            {
              "name": "指骨底(侧面)",
              "x": 29.03,
              "y": 70.62
            },
            {
              "name": "指骨滑车(侧面)",
              "x": 28.57,
              "y": 74.15
            },
            {
              "name": "桡骨茎突(腕背)",
              "x": 73.26,
              "y": 64.73
            },
            {
              "name": "指总伸肌腱",
              "x": 69.95,
              "y": 69.42
            },
            {
              "name": "腕骨(腕背)",
              "x": 71.25,
              "y": 75.49
            },
            {
              "name": "虎口腹凸",
              "x": 76.33,
              "y": 89.8
            },
            {
              "name": "掌长肌腱",
              "x": 83.17,
              "y": 64.71
            },
            {
              "name": "拇长展肌腱(腕背)",
              "x": 78.61,
              "y": 70.13
            },
            {
              "name": "掌骨底(腕背)",
              "x": 81.07,
              "y": 74.72
            },
            {
              "name": "掌骨头(腕背)",
              "x": 85.18,
              "y": 89.33
            }
          ]
        },
        {
          "id": "hand-summary",
          "label": "手部汇总(PPT)",
          "image": "images/16-hand-summary.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "hand-wrist-small",
          "label": "手势照片练习",
          "image": "images/50-hand-pose-learn.jpeg",
          "w": 764,
          "h": 1028,
          "editImage": "images/30-hand-wrist-small.jpeg",
          "editW": 131,
          "editH": 176,
          "practiceImage": "images/50-hand-pose-learn.jpeg",
          "practiceW": 764,
          "practiceH": 1028,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 40.17,
              "y": 92.95,
              "name": "尺骨茎突"
            },
            {
              "x": 60.36,
              "y": 74.02,
              "name": "掌骨底"
            },
            {
              "x": 39.32,
              "y": 28.91,
              "name": "指骨滑车"
            },
            {
              "x": 64.24,
              "y": 23.61,
              "name": "指骨底"
            },
            {
              "x": 55.56,
              "y": 43.83,
              "name": "掌骨头"
            },
            {
              "x": 58.9,
              "y": 86.74,
              "name": "腕骨"
            }
          ]
        }
      ]
    },
    {
      "id": "foot",
      "name": "足",
      "views": [
        {
          "id": "foot-top",
          "label": "双脚·俯视",
          "image": "images/01-foot-top.jpeg",
          "w": 735,
          "h": 643,
          "crop": {
            "x": 21,
            "y": 5,
            "w": 55,
            "h": 88
          },
          "points": [
            {
              "x": 49,
              "y": 27,
              "name": "第一跖趾侧凸"
            },
            {
              "x": 62,
              "y": 16,
              "name": "趾骨底"
            },
            {
              "x": 61,
              "y": 21,
              "name": "趾骨滑车"
            },
            {
              "x": 61.09,
              "y": 30.41,
              "name": "趾长伸肌腱"
            },
            {
              "x": 56.43,
              "y": 38.67,
              "name": "拇长伸肌腱"
            },
            {
              "x": 68.56,
              "y": 50.78,
              "name": "第五跖骨粗隆"
            },
            {
              "x": 67.03,
              "y": 61.87,
              "name": "骰骨"
            },
            {
              "x": 58.82,
              "y": 66.94,
              "name": "胫骨前肌腱"
            },
            {
              "x": 68.66,
              "y": 75.21,
              "name": "外踝"
            },
            {
              "x": 51,
              "y": 76.48,
              "name": "内踝"
            },
            {
              "x": 36.3,
              "y": 64.86,
              "name": "足横弓"
            },
            {
              "x": 31.15,
              "y": 61.76,
              "name": "趾长伸肌腱(左)"
            },
            {
              "x": 37.14,
              "y": 55.64,
              "name": "拇长伸肌腱(左)"
            },
            {
              "x": 38.04,
              "y": 46.07,
              "name": "跗跖关节凸"
            },
            {
              "x": 27.56,
              "y": 34.78,
              "name": "第五跖趾侧凸"
            },
            {
              "x": 33,
              "y": 20,
              "name": "趾拱"
            }
          ]
        },
        {
          "id": "foot-side-bone",
          "label": "足侧面骨性标志",
          "image": "images/28-foot-side-bone.jpeg",
          "w": 414,
          "h": 269,
          "editImage": "images/28-foot-side-bone.jpeg",
          "editW": 414,
          "editH": 269,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 46.82,
              "y": 35.84,
              "name": "前踝关节凸"
            },
            {
              "x": 59.98,
              "y": 20.35,
              "name": "距骨滑车"
            },
            {
              "x": 74.86,
              "y": 29.87,
              "name": "跟结节"
            },
            {
              "x": 50,
              "y": 51,
              "name": "跖骨底"
            },
            {
              "x": 22.53,
              "y": 57.99,
              "name": "跖趾关节外横凸"
            },
            {
              "x": 17,
              "y": 71,
              "name": "趾拱"
            },
            {
              "x": 40,
              "y": 75,
              "name": "跖趾关节内横凸"
            },
            {
              "x": 30.28,
              "y": 81.15,
              "name": "跖骨底"
            },
            {
              "x": 39.1,
              "y": 68.1,
              "name": "跖骨头"
            },
            {
              "x": 36.03,
              "y": 76.79,
              "name": "趾骨底"
            }
          ]
        },
        {
          "id": "foot-dorsum-tendons",
          "label": "足背肌腱彩色图",
          "image": "images/34-foot-dorsum-tendons.jpeg",
          "w": 570,
          "h": 945,
          "editImage": "images/34-foot-dorsum-tendons.jpeg",
          "editW": 570,
          "editH": 945,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 36,
              "y": 23,
              "name": "胫骨前肌腱"
            },
            {
              "x": 69.5,
              "y": 59.34,
              "name": "拇长伸肌腱"
            },
            {
              "x": 35,
              "y": 58,
              "name": "趾长伸肌腱"
            },
            {
              "x": 74.74,
              "y": 46.73,
              "name": "第一跖骨底"
            },
            {
              "x": 45,
              "y": 76,
              "name": "趾伸肌腱"
            },
            {
              "x": 75,
              "y": 88,
              "name": "第一跖趾关节"
            }
          ]
        },
        {
          "id": "foot-bone-landmarks",
          "label": "足骨线稿练习",
          "image": "images/53-foot-bone-learn.jpeg",
          "w": 1012,
          "h": 777,
          "editImage": "images/35-foot-bone-landmarks.jpeg",
          "editW": 458,
          "editH": 349,
          "practiceImage": "images/53-foot-bone-learn.jpeg",
          "practiceW": 1012,
          "practiceH": 777,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 39.81,
              "y": 32.99,
              "name": "外踝"
            },
            {
              "x": 23.49,
              "y": 30.39,
              "name": "内踝"
            },
            {
              "x": 35.5,
              "y": 27.67,
              "name": "踝关节"
            },
            {
              "x": 29.16,
              "y": 35.37,
              "name": "足横弓"
            },
            {
              "x": 40.12,
              "y": 43.02,
              "name": "骰骨"
            },
            {
              "x": 46.08,
              "y": 48.13,
              "name": "足外侧弓"
            },
            {
              "x": 51.23,
              "y": 69.78,
              "name": "跖趾关节外横凸"
            },
            {
              "x": 45.45,
              "y": 73.7,
              "name": "跖趾关节"
            },
            {
              "x": 49.49,
              "y": 56.3,
              "name": "第五跖趾侧凸"
            },
            {
              "x": 41.2,
              "y": 79.91,
              "name": "趾拱"
            },
            {
              "x": 29.49,
              "y": 50.8,
              "name": "跗跖关节"
            }
          ]
        },
        {
          "id": "foot-dorsum-photo",
          "label": "足背照片练习",
          "image": "images/49-foot-dorsum-learn.jpeg",
          "w": 546,
          "h": 360,
          "editImage": "images/02-foot-side.jpeg",
          "editW": 752,
          "editH": 494,
          "practiceImage": "images/49-foot-dorsum-learn.jpeg",
          "practiceW": 546,
          "practiceH": 360,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 37.58,
              "y": 24.11,
              "name": "内踝"
            },
            {
              "x": 21.1,
              "y": 38.1,
              "name": "腓骨长短肌腱"
            },
            {
              "x": 27.07,
              "y": 47.26,
              "name": "外踝"
            },
            {
              "x": 41.43,
              "y": 31.42,
              "name": "足横弓"
            },
            {
              "x": 55.06,
              "y": 41.22,
              "name": "跗跖关节凸"
            },
            {
              "x": 54.34,
              "y": 78.43,
              "name": "第五跖趾侧凸"
            },
            {
              "x": 72.13,
              "y": 54.96,
              "name": "第一跖趾侧凸"
            },
            {
              "x": 77.02,
              "y": 79.57,
              "name": "趾骨底"
            },
            {
              "x": 77.06,
              "y": 74.17,
              "name": "趾骨滑车"
            },
            {
              "x": 41.53,
              "y": 53.55,
              "name": "骰骨"
            },
            {
              "x": 45,
              "y": 72,
              "name": "第五跖骨粗隆"
            },
            {
              "x": 58.46,
              "y": 64.98,
              "name": "趾长伸肌腱"
            },
            {
              "x": 73.08,
              "y": 80.4,
              "name": "趾拱"
            }
          ]
        }
      ]
    },
    {
      "id": "upperlimb",
      "name": "上肢",
      "views": [
        {
          "id": "arms-knees",
          "label": "交叉手臂/膝",
          "image": "images/04-arms-knees.jpeg",
          "w": 694,
          "h": 476,
          "crop": {
            "x": 20,
            "y": 9,
            "w": 62,
            "h": 77
          },
          "points": [
            {
              "x": 25.53,
              "y": 22.42,
              "name": "肩峰"
            },
            {
              "x": 28.5,
              "y": 21.26,
              "name": "肩关节"
            },
            {
              "x": 31.8,
              "y": 24.43,
              "name": "肱骨小结节"
            },
            {
              "x": 64.97,
              "y": 18.49,
              "name": "膝关节"
            },
            {
              "x": 26.41,
              "y": 26.1,
              "name": "肱骨大结节"
            },
            {
              "x": 78,
              "y": 23,
              "name": "肱骨头"
            },
            {
              "x": 31.55,
              "y": 36.23,
              "name": "桡骨茎突"
            },
            {
              "x": 76.07,
              "y": 43.47,
              "name": "腕关节"
            },
            {
              "x": 27.79,
              "y": 47.13,
              "name": "尺骨茎突"
            },
            {
              "x": 77.78,
              "y": 47.45,
              "name": "腕骨"
            },
            {
              "x": 83.01,
              "y": 50.51,
              "name": "掌骨头"
            },
            {
              "x": 39,
              "y": 60,
              "name": "肱骨外上髁"
            },
            {
              "x": 68.53,
              "y": 55.9,
              "name": "尺骨线"
            },
            {
              "x": 32.12,
              "y": 76.34,
              "name": "肘关节"
            },
            {
              "x": 31.92,
              "y": 68.25,
              "name": "肱骨内上髁"
            },
            {
              "x": 34.82,
              "y": 82.37,
              "name": "尺骨鹰嘴"
            }
          ]
        },
        {
          "id": "arm-sketch",
          "label": "手臂肌肉素描",
          "image": "images/13-arm-sketch.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "forearm-photo",
          "label": "前臂照片",
          "image": "images/14-forearm-photo.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "shoulder-clavicle",
          "label": "锁骨肩带",
          "image": "images/25-shoulder-clavicle.jpeg",
          "w": 721,
          "h": 1088,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "forearm-bone",
          "label": "前臂骨性标志",
          "image": "images/56-forearm-bone-learn.jpeg",
          "w": 872,
          "h": 900,
          "editImage": "images/29-forearm-bone.jpeg",
          "editW": 378,
          "editH": 390,
          "practiceImage": "images/56-forearm-bone-learn.jpeg",
          "practiceW": 872,
          "practiceH": 900,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 31,
              "y": 19,
              "name": "尺骨鹰突"
            },
            {
              "x": 46.93,
              "y": 17.54,
              "name": "肱骨外上髁"
            },
            {
              "x": 44.85,
              "y": 54.05,
              "name": "尺骨线"
            },
            {
              "x": 45.51,
              "y": 61.46,
              "name": "尺骨茎突"
            },
            {
              "x": 52,
              "y": 68,
              "name": "腕骨"
            },
            {
              "x": 63.47,
              "y": 88.63,
              "name": "指骨滑车"
            },
            {
              "x": 62.31,
              "y": 59.81,
              "name": "桡骨茎突"
            },
            {
              "x": 64.08,
              "y": 63.83,
              "name": "掌骨底"
            },
            {
              "x": 69.03,
              "y": 66.68,
              "name": "掌骨头"
            },
            {
              "x": 76,
              "y": 79,
              "name": "指骨底"
            }
          ]
        },
        {
          "id": "upperlimb-flexed",
          "label": "屈肘上肢练习",
          "image": "images/54-upperlimb-flexed-learn.jpeg",
          "w": 1870,
          "h": 1680,
          "editImage": "images/32-upperlimb-flexed.jpeg",
          "editW": 595,
          "editH": 534,
          "practiceImage": "images/54-upperlimb-flexed-learn.jpeg",
          "practiceW": 1870,
          "practiceH": 1680,
          "practicePoints": [
            {
              "x": 10,
              "y": 44.98,
              "name": "锁骨"
            },
            {
              "x": 24.41,
              "y": 62.14,
              "name": "三角肌"
            },
            {
              "x": 49.48,
              "y": 57.63,
              "name": "肱二头肌"
            },
            {
              "x": 57.09,
              "y": 69.84,
              "name": "肱肌"
            },
            {
              "x": 64.95,
              "y": 63.68,
              "name": "前臂内侧肌群"
            },
            {
              "x": 53.99,
              "y": 20.63,
              "name": "腕骨"
            },
            {
              "x": 56.92,
              "y": 24.78,
              "name": "桡骨茎突"
            },
            {
              "x": 44.71,
              "y": 13.31,
              "name": "掌骨头"
            },
            {
              "x": 94.78,
              "y": 79.4,
              "name": "肱骨外上髁"
            },
            {
              "x": 95.61,
              "y": 87.5,
              "name": "尺骨鹰嘴"
            },
            {
              "x": 82.98,
              "y": 91.79,
              "name": "肱骨"
            },
            {
              "x": 68.17,
              "y": 84.33,
              "name": "肱三头肌"
            },
            {
              "x": 10.76,
              "y": 53.3,
              "name": "肩峰"
            },
            {
              "x": 0.9,
              "y": 47.25,
              "name": "斜方肌"
            },
            {
              "x": 54.33,
              "y": 36.22,
              "name": "尺骨"
            },
            {
              "x": 29,
              "y": 7.35,
              "name": "指骨"
            },
            {
              "x": 33.31,
              "y": 12.59,
              "name": "指骨滑车"
            },
            {
              "x": 40.16,
              "y": 4.19,
              "name": "掌骨"
            },
            {
              "x": 41.88,
              "y": 19.95,
              "name": "拇指球"
            },
            {
              "x": 43.82,
              "y": 26.77,
              "name": "小指球"
            },
            {
              "x": 80.08,
              "y": 54.87,
              "name": "前臂背侧肌群"
            }
          ],
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 22.72,
              "y": 52.17,
              "name": "锁骨"
            },
            {
              "x": 32.7,
              "y": 63,
              "name": "三角肌"
            },
            {
              "x": 50.06,
              "y": 60.15,
              "name": "肱二头肌"
            },
            {
              "x": 55.33,
              "y": 67.86,
              "name": "肱肌"
            },
            {
              "x": 60.77,
              "y": 63.97,
              "name": "前臂内侧肌群"
            },
            {
              "x": 53.18,
              "y": 36.8,
              "name": "腕骨"
            },
            {
              "x": 55.21,
              "y": 39.42,
              "name": "桡骨茎突"
            },
            {
              "x": 46.76,
              "y": 32.18,
              "name": "掌骨头"
            },
            {
              "x": 81.43,
              "y": 73.89,
              "name": "肱骨外上髁"
            },
            {
              "x": 82,
              "y": 79,
              "name": "尺骨鹰嘴"
            },
            {
              "x": 73.26,
              "y": 81.71,
              "name": "肱骨"
            },
            {
              "x": 63,
              "y": 77,
              "name": "肱三头肌"
            },
            {
              "x": 23.25,
              "y": 57.42,
              "name": "肩峰"
            },
            {
              "x": 16.42,
              "y": 53.6,
              "name": "斜方肌"
            },
            {
              "x": 53.42,
              "y": 46.64,
              "name": "尺骨"
            },
            {
              "x": 35.88,
              "y": 28.42,
              "name": "指骨"
            },
            {
              "x": 38.86,
              "y": 31.73,
              "name": "指骨滑车"
            },
            {
              "x": 43.61,
              "y": 26.43,
              "name": "掌骨"
            },
            {
              "x": 44.8,
              "y": 36.37,
              "name": "拇指球"
            },
            {
              "x": 46.14,
              "y": 40.68,
              "name": "小指球"
            },
            {
              "x": 71.25,
              "y": 58.41,
              "name": "前臂背侧肌群"
            }
          ]
        }
      ]
    },
    {
      "id": "lowerlimb",
      "name": "下肢",
      "views": [
        {
          "id": "leg-photo",
          "label": "小腿照片",
          "image": "images/10-leg-photo.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 30,
            "y": 15,
            "w": 40,
            "h": 80
          },
          "points": [
            {
              "x": 35.26,
              "y": 38.69,
              "name": "缝匠肌沟"
            },
            {
              "x": 61.03,
              "y": 53.35,
              "name": "股胫骨外侧髁"
            },
            {
              "x": 57.68,
              "y": 63.13,
              "name": "髌骨"
            },
            {
              "x": 62.93,
              "y": 57.79,
              "name": "腓骨头"
            },
            {
              "x": 56.13,
              "y": 58.08,
              "name": "髌韧带"
            },
            {
              "x": 58.4,
              "y": 60.39,
              "name": "胫骨粗隆"
            },
            {
              "x": 59.54,
              "y": 68.92,
              "name": "前肌线"
            },
            {
              "x": 60.9,
              "y": 74.95,
              "name": "胫骨线"
            },
            {
              "x": 44.49,
              "y": 59.17,
              "name": "股胫骨内侧髁"
            },
            {
              "x": 55.16,
              "y": 71.66,
              "name": "胫骨内侧面"
            },
            {
              "x": 55.43,
              "y": 75.81,
              "name": "腓肠肌线"
            },
            {
              "x": 58.42,
              "y": 87.22,
              "name": "比目鱼肌线"
            }
          ]
        },
        {
          "id": "thigh-sketch",
          "label": "大腿肌肉素描",
          "image": "images/12-thigh-sketch.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "legs-back",
          "label": "双腿背面素描",
          "image": "images/18-legs-back.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "lowerleg-medial-ankle",
          "label": "小腿内侧/足踝练习",
          "image": "images/52-lowerleg-medial-learn.jpeg",
          "w": 360,
          "h": 546,
          "editImage": "images/31-lowerleg-medial-ankle.jpeg",
          "editW": 488,
          "editH": 744,
          "practiceImage": "images/52-lowerleg-medial-learn.jpeg",
          "practiceW": 360,
          "practiceH": 546,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 54.8,
              "y": 4.75,
              "name": "股四头肌腱沟"
            },
            {
              "x": 44.49,
              "y": 14.19,
              "name": "髌骨"
            },
            {
              "x": 43.31,
              "y": 19.68,
              "name": "髌韧带"
            },
            {
              "x": 42.6,
              "y": 24.77,
              "name": "胫骨粗隆"
            },
            {
              "x": 40.36,
              "y": 30.88,
              "name": "胫骨前肌线"
            },
            {
              "x": 61.48,
              "y": 17.57,
              "name": "骨胫骨内侧踝"
            },
            {
              "x": 48.93,
              "y": 32.89,
              "name": "胫骨内侧面"
            },
            {
              "x": 51.13,
              "y": 47.63,
              "name": "腓肠肌线"
            },
            {
              "x": 57.65,
              "y": 73.21,
              "name": "内踝"
            },
            {
              "x": 43.34,
              "y": 79.4,
              "name": "足横弓"
            },
            {
              "x": 51.26,
              "y": 77.9,
              "name": "胫骨前肌腱"
            },
            {
              "x": 51.81,
              "y": 89.28,
              "name": "足内侧弓"
            },
            {
              "x": 44.6,
              "y": 95.09,
              "name": "跖趾关节内侧凸"
            },
            {
              "x": 45.71,
              "y": 82.6,
              "name": "跗跖关节凸"
            },
            {
              "x": 43.69,
              "y": 73.82,
              "name": "趾长伸肌腱"
            }
          ]
        },
        {
          "id": "lowerleg-front",
          "label": "小腿正面",
          "image": "images/55-lowerleg-front-learn.jpeg",
          "w": 466,
          "h": 589,
          "editImage": "images/33-lowerleg-front.jpeg",
          "editW": 466,
          "editH": 589,
          "practiceImage": "images/55-lowerleg-front-learn.jpeg",
          "practiceW": 466,
          "practiceH": 589,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 50,
              "y": 7,
              "name": "股骨"
            },
            {
              "x": 38,
              "y": 14,
              "name": "股薄肌"
            },
            {
              "x": 38.77,
              "y": 20.16,
              "name": "缝匠肌"
            },
            {
              "x": 57.63,
              "y": 18.42,
              "name": "股直肌"
            },
            {
              "x": 63.21,
              "y": 28.58,
              "name": "股外肌"
            },
            {
              "x": 42,
              "y": 33,
              "name": "股内肌"
            },
            {
              "x": 39,
              "y": 46,
              "name": "股内肌线"
            },
            {
              "x": 58,
              "y": 37,
              "name": "股四头肌腱沟"
            },
            {
              "x": 52.18,
              "y": 51.32,
              "name": "髌骨"
            },
            {
              "x": 36.4,
              "y": 49.86,
              "name": "股胫骨内侧髁"
            },
            {
              "x": 48.67,
              "y": 57.43,
              "name": "髌韧带"
            },
            {
              "x": 49.55,
              "y": 65.65,
              "name": "胫骨粗隆"
            },
            {
              "x": 60.7,
              "y": 62.4,
              "name": "腓骨头"
            },
            {
              "x": 52.86,
              "y": 81.24,
              "name": "胫骨前肌"
            },
            {
              "x": 60.18,
              "y": 72.66,
              "name": "腓骨长短肌"
            },
            {
              "x": 37.51,
              "y": 76.56,
              "name": "腓肠肌"
            },
            {
              "x": 42.07,
              "y": 79.85,
              "name": "胫骨内侧面"
            },
            {
              "x": 39.5,
              "y": 88.3,
              "name": "比目鱼肌"
            },
            {
              "x": 50.33,
              "y": 87.09,
              "name": "胫骨"
            },
            {
              "x": 58.48,
              "y": 86.49,
              "name": "腓骨"
            },
            {
              "x": 60.46,
              "y": 46.15,
              "name": "髂胫束"
            }
          ]
        },
        {
          "id": "lowerlimb-muscle-sketch",
          "label": "下肢肌肉素描",
          "image": "images/36-lowerlimb-muscle-sketch.jpeg",
          "w": 240,
          "h": 709,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "lowerlimb-muscle-color",
          "label": "下肢肌肉彩色图",
          "image": "images/37-lowerlimb-muscle-color.jpeg",
          "w": 615,
          "h": 1278,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "lowerleg-front-class",
          "label": "小腿正面课堂标注",
          "image": "images/58-lowerleg-front-class.jpeg",
          "w": 1702,
          "h": 1276,
          "editImage": "images/58-lowerleg-front-class.jpeg",
          "editW": 1702,
          "editH": 1276,
          "practiceImage": "images/63-lowerleg-front-class-learn-v2.png",
          "practiceW": 2304,
          "practiceH": 1728,
          "practicePoints": [
            {
              "x": 44.1,
              "y": 43.42,
              "name": "股胫骨内侧髁"
            },
            {
              "x": 33.34,
              "y": 34.52,
              "name": "股四头肌腱沟"
            },
            {
              "x": 30.2,
              "y": 40.18,
              "name": "股胫骨外侧髁"
            },
            {
              "x": 31.05,
              "y": 46.33,
              "name": "腓骨头"
            },
            {
              "x": 35,
              "y": 50,
              "name": "胫骨粗隆"
            },
            {
              "x": 32.43,
              "y": 57.78,
              "name": "胫骨前肌线"
            },
            {
              "x": 34.28,
              "y": 67.17,
              "name": "胫骨线"
            },
            {
              "x": 32.1,
              "y": 75.05,
              "name": "趾长伸肌腱"
            },
            {
              "x": 30.05,
              "y": 78.07,
              "name": "外踝"
            },
            {
              "x": 33.32,
              "y": 82.1,
              "name": "跖趾关节凸"
            },
            {
              "x": 33.03,
              "y": 86.72,
              "name": "足内侧弓"
            },
            {
              "x": 40.01,
              "y": 83.71,
              "name": "跟结节"
            },
            {
              "x": 39.5,
              "y": 17.14,
              "name": "缝匠肌沟"
            },
            {
              "x": 51.37,
              "y": 42.24,
              "name": "髌骨"
            },
            {
              "x": 49.93,
              "y": 46.51,
              "name": "髌韧带"
            },
            {
              "x": 46.03,
              "y": 54.68,
              "name": "胫骨内侧面"
            },
            {
              "x": 45.07,
              "y": 60.38,
              "name": "腓肠肌线"
            },
            {
              "x": 43.94,
              "y": 66.31,
              "name": "比目鱼肌线"
            },
            {
              "x": 47.37,
              "y": 71.58,
              "name": "胫骨线(右)"
            },
            {
              "x": 48.12,
              "y": 78.22,
              "name": "足横弓"
            },
            {
              "x": 54.25,
              "y": 86.13,
              "name": "跖趾关节内横凸"
            },
            {
              "x": 41.83,
              "y": 80.16,
              "name": "跟腱"
            },
            {
              "x": 43.94,
              "y": 76.57,
              "name": "内踝"
            }
          ],
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 44.1,
              "y": 43.42,
              "name": "股胫骨内侧髁"
            },
            {
              "x": 33.34,
              "y": 34.52,
              "name": "股四头肌腱沟"
            },
            {
              "x": 30.2,
              "y": 40.18,
              "name": "股胫骨外侧髁"
            },
            {
              "x": 31.05,
              "y": 46.33,
              "name": "腓骨头"
            },
            {
              "x": 35,
              "y": 50,
              "name": "胫骨粗隆"
            },
            {
              "x": 32.43,
              "y": 57.78,
              "name": "胫骨前肌线"
            },
            {
              "x": 34.28,
              "y": 67.17,
              "name": "胫骨线"
            },
            {
              "x": 32.1,
              "y": 75.05,
              "name": "趾长伸肌腱"
            },
            {
              "x": 30.05,
              "y": 78.07,
              "name": "外踝"
            },
            {
              "x": 33.32,
              "y": 82.1,
              "name": "跖趾关节凸"
            },
            {
              "x": 33.03,
              "y": 86.72,
              "name": "足内侧弓"
            },
            {
              "x": 40.01,
              "y": 83.71,
              "name": "跟结节"
            },
            {
              "x": 39.5,
              "y": 17.14,
              "name": "缝匠肌沟"
            },
            {
              "x": 51.37,
              "y": 42.24,
              "name": "髌骨"
            },
            {
              "x": 49.93,
              "y": 46.51,
              "name": "髌韧带"
            },
            {
              "x": 46.03,
              "y": 54.68,
              "name": "胫骨内侧面"
            },
            {
              "x": 45.07,
              "y": 60.38,
              "name": "腓肠肌线"
            },
            {
              "x": 43.94,
              "y": 66.31,
              "name": "比目鱼肌线"
            },
            {
              "x": 47.37,
              "y": 71.58,
              "name": "胫骨线(右)"
            },
            {
              "x": 48.12,
              "y": 78.22,
              "name": "足横弓"
            },
            {
              "x": 54.25,
              "y": 86.13,
              "name": "跖趾关节内横凸"
            },
            {
              "x": 41.83,
              "y": 80.16,
              "name": "跟腱"
            },
            {
              "x": 43.94,
              "y": 76.57,
              "name": "内踝"
            }
          ]
        },
        {
          "id": "lowerleg-side-class",
          "label": "小腿侧后课堂标注",
          "image": "images/60-lowerleg-side-class.jpeg",
          "w": 1702,
          "h": 1276,
          "editImage": "images/60-lowerleg-side-class.jpeg",
          "editW": 1702,
          "editH": 1276,
          "practiceImage": "images/62-lowerleg-side-class-learn.jpeg",
          "practiceW": 2048,
          "practiceH": 1536,
          "practicePoints": [
            {
              "x": 48.12,
              "y": 43.84,
              "name": "股胫骨内侧髁"
            },
            {
              "x": 50.23,
              "y": 48.61,
              "name": "膝后纹"
            },
            {
              "x": 51.2,
              "y": 82.7,
              "name": "足横弓"
            },
            {
              "x": 45,
              "y": 80,
              "name": "跟腱"
            },
            {
              "x": 47.66,
              "y": 82.56,
              "name": "外踝"
            },
            {
              "x": 43.78,
              "y": 85.87,
              "name": "跟结节"
            },
            {
              "x": 48.97,
              "y": 87.95,
              "name": "骰骨"
            },
            {
              "x": 58.31,
              "y": 15.69,
              "name": "大转子"
            },
            {
              "x": 56.78,
              "y": 20.03,
              "name": "髋关节窝"
            },
            {
              "x": 55.67,
              "y": 33.42,
              "name": "髂胫束沟"
            },
            {
              "x": 51.08,
              "y": 43.58,
              "name": "腘窝"
            },
            {
              "x": 52.84,
              "y": 48.04,
              "name": "肌腱群"
            },
            {
              "x": 53.22,
              "y": 52.82,
              "name": "腓骨小头"
            },
            {
              "x": 50.9,
              "y": 63.38,
              "name": "腓肠肌线"
            },
            {
              "x": 49.24,
              "y": 69.8,
              "name": "比目鱼肌线"
            },
            {
              "x": 55.36,
              "y": 74.21,
              "name": "跖趾关节内横凸"
            },
            {
              "x": 51.43,
              "y": 74.84,
              "name": "足内侧弓"
            },
            {
              "x": 57.11,
              "y": 87.54,
              "name": "趾拱"
            },
            {
              "x": 53.4,
              "y": 91.07,
              "name": "跖趾关节外横凸"
            },
            {
              "x": 47.83,
              "y": 91.88,
              "name": "足外侧弓"
            }
          ],
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 48.12,
              "y": 43.84,
              "name": "股胫骨内侧髁"
            },
            {
              "x": 50.23,
              "y": 48.61,
              "name": "膝后纹"
            },
            {
              "x": 51.2,
              "y": 82.7,
              "name": "足横弓"
            },
            {
              "x": 45,
              "y": 80,
              "name": "跟腱"
            },
            {
              "x": 47.66,
              "y": 82.56,
              "name": "外踝"
            },
            {
              "x": 43.78,
              "y": 85.87,
              "name": "跟结节"
            },
            {
              "x": 48.97,
              "y": 87.95,
              "name": "骰骨"
            },
            {
              "x": 58.31,
              "y": 15.69,
              "name": "大转子"
            },
            {
              "x": 56.78,
              "y": 20.03,
              "name": "髋关节窝"
            },
            {
              "x": 55.67,
              "y": 33.42,
              "name": "髂胫束沟"
            },
            {
              "x": 51.08,
              "y": 43.58,
              "name": "腘窝"
            },
            {
              "x": 52.84,
              "y": 48.04,
              "name": "肌腱群"
            },
            {
              "x": 53.22,
              "y": 52.82,
              "name": "腓骨小头"
            },
            {
              "x": 50.9,
              "y": 63.38,
              "name": "腓肠肌线"
            },
            {
              "x": 49.24,
              "y": 69.8,
              "name": "比目鱼肌线"
            },
            {
              "x": 55.36,
              "y": 74.21,
              "name": "跖趾关节内横凸"
            },
            {
              "x": 51.43,
              "y": 74.84,
              "name": "足内侧弓"
            },
            {
              "x": 57.11,
              "y": 87.54,
              "name": "趾拱"
            },
            {
              "x": 53.4,
              "y": 91.07,
              "name": "跖趾关节外横凸"
            },
            {
              "x": 47.83,
              "y": 91.88,
              "name": "足外侧弓"
            }
          ]
        }
      ]
    },
    {
      "id": "torso",
      "name": "躯干",
      "views": [
        {
          "id": "torso-photo",
          "label": "躯干照片·正面",
          "image": "images/08-torso-photo.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 23,
            "y": 2,
            "w": 54,
            "h": 96
          },
          "points": [
            {
              "x": 46,
              "y": 6,
              "name": "喉结"
            },
            {
              "x": 50.69,
              "y": 17.42,
              "name": "胸锁乳突肌线"
            },
            {
              "x": 29.29,
              "y": 15.77,
              "name": "锁骨上窝"
            },
            {
              "x": 38,
              "y": 19,
              "name": "锁骨"
            },
            {
              "x": 41,
              "y": 22,
              "name": "锁骨下窝"
            },
            {
              "x": 31,
              "y": 23,
              "name": "三角肌线"
            },
            {
              "x": 48,
              "y": 30,
              "name": "中胸沟"
            },
            {
              "x": 47,
              "y": 35,
              "name": "胸窝"
            },
            {
              "x": 65.31,
              "y": 21.14,
              "name": "喙肱肌线"
            },
            {
              "x": 55,
              "y": 39,
              "name": "乳下弧线"
            },
            {
              "x": 70,
              "y": 41,
              "name": "肩胛骨腋侧缘"
            },
            {
              "x": 65,
              "y": 45,
              "name": "前锯肌沟"
            },
            {
              "x": 47,
              "y": 55,
              "name": "腹直肌沟"
            },
            {
              "x": 58,
              "y": 51,
              "name": "肋弓"
            },
            {
              "x": 40,
              "y": 50,
              "name": "胸廓底边"
            },
            {
              "x": 38,
              "y": 61,
              "name": "腹侧沟"
            },
            {
              "x": 60,
              "y": 63,
              "name": "腹外斜肌线"
            },
            {
              "x": 47,
              "y": 67,
              "name": "腹白线"
            },
            {
              "x": 62,
              "y": 71,
              "name": "髂前上嵴"
            }
          ]
        },
        {
          "id": "torso-sketch",
          "label": "躯干素描",
          "image": "images/07-torso-sketch.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "torso-shoulder-chest",
          "label": "颈肩胸练习",
          "image": "images/48-torso-shoulder-learn.jpeg",
          "w": 1008,
          "h": 780,
          "editImage": "images/27-torso-shoulder-chest.jpeg",
          "editW": 437,
          "editH": 338,
          "practiceImage": "images/48-torso-shoulder-learn.jpeg",
          "practiceW": 1008,
          "practiceH": 780,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 43.42,
              "y": 36.08,
              "name": "胸锁乳突肌线"
            },
            {
              "x": 55.18,
              "y": 43.95,
              "name": "颈窝"
            },
            {
              "x": 40.82,
              "y": 41.66,
              "name": "锁骨上窝"
            },
            {
              "x": 43.75,
              "y": 47.74,
              "name": "锁骨"
            },
            {
              "x": 22.6,
              "y": 47.7,
              "name": "肩峰(左)"
            },
            {
              "x": 22.5,
              "y": 55.8,
              "name": "肱骨头(左)"
            },
            {
              "x": 40.8,
              "y": 51.74,
              "name": "锁骨下窝"
            },
            {
              "x": 60.86,
              "y": 66.29,
              "name": "中胸沟"
            },
            {
              "x": 62,
              "y": 72.27,
              "name": "胸窝"
            },
            {
              "x": 69.75,
              "y": 75.08,
              "name": "乳下弧线"
            },
            {
              "x": 61,
              "y": 77.4,
              "name": "腹侧沟"
            },
            {
              "x": 62.07,
              "y": 85.27,
              "name": "腹白线"
            },
            {
              "x": 42.69,
              "y": 23.6,
              "name": "下颚角"
            },
            {
              "x": 53.85,
              "y": 33.38,
              "name": "喉结"
            },
            {
              "x": 58.85,
              "y": 29.57,
              "name": "颏结节"
            },
            {
              "x": 59.74,
              "y": 56.42,
              "name": "胸骨角"
            },
            {
              "x": 37.44,
              "y": 62.72,
              "name": "侧胸沟"
            },
            {
              "x": 20.38,
              "y": 81.95,
              "name": "三角肌尾"
            },
            {
              "x": 31.47,
              "y": 70.7,
              "name": "三角肌线"
            }
          ]
        },
        {
          "id": "torso-front-class",
          "label": "躯干正面课堂标注",
          "image": "images/57-torso-front-class.jpeg",
          "w": 1702,
          "h": 1276,
          "editImage": "images/57-torso-front-class.jpeg",
          "editW": 1702,
          "editH": 1276,
          "practiceImage": "images/61-torso-front-class-learn-v2.png",
          "practiceW": 2304,
          "practiceH": 1728,
          "practicePoints": [
            {
              "x": 35.8,
              "y": 10.8,
              "name": "尺骨茎突"
            },
            {
              "x": 36.1,
              "y": 15.8,
              "name": "掌长肌腱"
            },
            {
              "x": 22.5,
              "y": 30.6,
              "name": "尺骨鹰突"
            },
            {
              "x": 21.8,
              "y": 35.5,
              "name": "肱骨内上髁"
            },
            {
              "x": 31,
              "y": 38.6,
              "name": "肱二头肌线"
            },
            {
              "x": 36.5,
              "y": 43,
              "name": "喙肱肌线"
            },
            {
              "x": 36,
              "y": 52.4,
              "name": "肩胛骨腋侧缘"
            },
            {
              "x": 41.3,
              "y": 59.1,
              "name": "前锯肌沟"
            },
            {
              "x": 45.4,
              "y": 66,
              "name": "肋弓"
            },
            {
              "x": 43.5,
              "y": 73.5,
              "name": "胸廓底边"
            },
            {
              "x": 45.2,
              "y": 78.4,
              "name": "腹侧沟"
            },
            {
              "x": 43,
              "y": 82.2,
              "name": "腹外斜肌线"
            },
            {
              "x": 42.2,
              "y": 86.2,
              "name": "髂嵴"
            },
            {
              "x": 53,
              "y": 91,
              "name": "耻骨联合"
            },
            {
              "x": 45,
              "y": 97,
              "name": "阔筋膜张肌线"
            },
            {
              "x": 52.5,
              "y": 30.5,
              "name": "喉结"
            },
            {
              "x": 55,
              "y": 25.8,
              "name": "胸骨柄"
            },
            {
              "x": 55.2,
              "y": 35.8,
              "name": "锁骨"
            },
            {
              "x": 53.2,
              "y": 38.5,
              "name": "锁骨上窝"
            },
            {
              "x": 52.5,
              "y": 42,
              "name": "颈窝"
            },
            {
              "x": 47.2,
              "y": 27.2,
              "name": "胸锁乳突肌线"
            },
            {
              "x": 62.5,
              "y": 36.4,
              "name": "三角肌线"
            },
            {
              "x": 55,
              "y": 43,
              "name": "锁骨下窝"
            },
            {
              "x": 55,
              "y": 50.2,
              "name": "中胸沟"
            },
            {
              "x": 55.8,
              "y": 55,
              "name": "乳下弧线"
            },
            {
              "x": 55,
              "y": 60.6,
              "name": "胸窝"
            },
            {
              "x": 54,
              "y": 69.7,
              "name": "腹直肌沟"
            },
            {
              "x": 53.5,
              "y": 78,
              "name": "腹白线"
            },
            {
              "x": 58.2,
              "y": 85.7,
              "name": "髂前上嵴"
            },
            {
              "x": 58.5,
              "y": 91.5,
              "name": "腹股沟"
            },
            {
              "x": 55,
              "y": 97,
              "name": "缝匠肌沟"
            },
            {
              "x": 72.2,
              "y": 14.5,
              "name": "掌长肌腱(右)"
            },
            {
              "x": 74,
              "y": 43,
              "name": "锁骨下窝(右)"
            }
          ],
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 35.8,
              "y": 10.8,
              "name": "尺骨茎突"
            },
            {
              "x": 36.1,
              "y": 15.8,
              "name": "掌长肌腱"
            },
            {
              "x": 19.16,
              "y": 28.9,
              "name": "尺骨鹰突"
            },
            {
              "x": 22.84,
              "y": 29.3,
              "name": "肱骨内上髁"
            },
            {
              "x": 30.58,
              "y": 36.72,
              "name": "肱二头肌线"
            },
            {
              "x": 36.71,
              "y": 39.96,
              "name": "喙肱肌线"
            },
            {
              "x": 36.07,
              "y": 50.7,
              "name": "肩胛骨腋侧缘"
            },
            {
              "x": 40.44,
              "y": 56.77,
              "name": "前锯肌沟"
            },
            {
              "x": 47.75,
              "y": 62.68,
              "name": "肋弓"
            },
            {
              "x": 41.86,
              "y": 69.4,
              "name": "胸廓底边"
            },
            {
              "x": 47.48,
              "y": 74.62,
              "name": "腹侧沟"
            },
            {
              "x": 45.7,
              "y": 77.33,
              "name": "腹外斜肌线"
            },
            {
              "x": 41.83,
              "y": 80.79,
              "name": "髂嵴"
            },
            {
              "x": 52.2,
              "y": 86.12,
              "name": "耻骨联合"
            },
            {
              "x": 40.39,
              "y": 90.55,
              "name": "阔筋膜张肌线"
            },
            {
              "x": 52.69,
              "y": 34.14,
              "name": "喉结"
            },
            {
              "x": 51.72,
              "y": 40.99,
              "name": "胸骨柄"
            },
            {
              "x": 55.11,
              "y": 39.84,
              "name": "锁骨"
            },
            {
              "x": 46.89,
              "y": 37.64,
              "name": "锁骨上窝"
            },
            {
              "x": 52.21,
              "y": 43.73,
              "name": "颈窝"
            },
            {
              "x": 48.63,
              "y": 32.3,
              "name": "胸锁乳突肌线"
            },
            {
              "x": 62.08,
              "y": 37.48,
              "name": "三角肌线"
            },
            {
              "x": 57.87,
              "y": 40.93,
              "name": "锁骨下窝"
            },
            {
              "x": 52.25,
              "y": 46.87,
              "name": "中胸沟"
            },
            {
              "x": 56.01,
              "y": 50.91,
              "name": "乳下弧线"
            },
            {
              "x": 52.96,
              "y": 56.59,
              "name": "胸窝"
            },
            {
              "x": 53.16,
              "y": 65.06,
              "name": "腹直肌沟"
            },
            {
              "x": 53.3,
              "y": 74.71,
              "name": "腹白线"
            },
            {
              "x": 58.77,
              "y": 80.25,
              "name": "髂前上嵴"
            },
            {
              "x": 55.59,
              "y": 85.51,
              "name": "腹股沟"
            },
            {
              "x": 46.86,
              "y": 92.98,
              "name": "缝匠肌沟"
            },
            {
              "x": 69.22,
              "y": 18.7,
              "name": "掌长肌腱(右)"
            },
            {
              "x": 73.8,
              "y": 41.2,
              "name": "锁骨下窝(右)"
            }
          ]
        }
      ]
    },
    {
      "id": "back",
      "name": "背部",
      "views": [
        {
          "id": "back-linedrawing",
          "label": "背部线描图",
          "image": "images/21-fullbody-squat2.jpeg",
          "w": 1024,
          "h": 768,
          "crop": {
            "x": 34,
            "y": 12,
            "w": 32,
            "h": 67
          },
          "masks": [
            {
              "x": 44,
              "y": 50,
              "w": 14,
              "h": 4.5,
              "c": "#d6d7d2"
            },
            {
              "x": 43,
              "y": 64,
              "w": 8.5,
              "h": 7.5,
              "c": "#d3d4cf"
            },
            {
              "x": 60,
              "y": 14,
              "w": 8,
              "h": 11,
              "c": "#dedfdb"
            },
            {
              "x": 32,
              "y": 27,
              "w": 9,
              "h": 10,
              "c": "#d7d8d3"
            },
            {
              "x": 60,
              "y": 47,
              "w": 8,
              "h": 18,
              "c": "#d0d1cc"
            }
          ],
          "points": [
            {
              "x": 50.54,
              "y": 19.06,
              "name": "枕外粗隆"
            },
            {
              "x": 52.84,
              "y": 22.08,
              "name": "项窝"
            },
            {
              "x": 53,
              "y": 26,
              "name": "第七颈椎棘突(菱形)"
            },
            {
              "x": 47,
              "y": 29,
              "name": "肩胛内上角"
            },
            {
              "x": 43,
              "y": 32,
              "name": "肩峰"
            },
            {
              "x": 53,
              "y": 34,
              "name": "脊柱沟/嵴"
            },
            {
              "x": 46,
              "y": 35,
              "name": "肩胛冈"
            },
            {
              "x": 51.87,
              "y": 38.03,
              "name": "肩胛脊侧缘"
            },
            {
              "x": 58.06,
              "y": 43.01,
              "name": "肩胛下角"
            },
            {
              "x": 67.82,
              "y": 43.06,
              "name": "肱骨外上髁"
            },
            {
              "x": 66.73,
              "y": 45.81,
              "name": "尺骨鹰嘴(右)"
            },
            {
              "x": 40.29,
              "y": 44.17,
              "name": "三角肌线"
            },
            {
              "x": 37.62,
              "y": 49.27,
              "name": "三角肌尾"
            },
            {
              "x": 38.07,
              "y": 53.81,
              "name": "肱三头肌腱"
            },
            {
              "x": 46.92,
              "y": 58.86,
              "name": "骶棘肌线"
            },
            {
              "x": 34.81,
              "y": 62.54,
              "name": "尺骨鹰嘴(左)"
            },
            {
              "x": 39.23,
              "y": 61.52,
              "name": "肱骨内上髁"
            },
            {
              "x": 32.12,
              "y": 74.18,
              "name": "尺骨线"
            },
            {
              "x": 31.59,
              "y": 80.54,
              "name": "掌长肌腱"
            },
            {
              "x": 54.51,
              "y": 56.89,
              "name": "腰间三角"
            },
            {
              "x": 58.56,
              "y": 56.16,
              "name": "胸廓底边"
            },
            {
              "x": 60.15,
              "y": 59.92,
              "name": "髂嵴"
            },
            {
              "x": 50.58,
              "y": 61.96,
              "name": "第五腰椎棘突"
            },
            {
              "x": 53.83,
              "y": 64.26,
              "name": "髂后上棘"
            },
            {
              "x": 51.23,
              "y": 65.38,
              "name": "腰骶菱形窝"
            },
            {
              "x": 48.41,
              "y": 73.45,
              "name": "臀沟"
            },
            {
              "x": 60.74,
              "y": 73.94,
              "name": "大转子"
            },
            {
              "x": 57.11,
              "y": 76.02,
              "name": "髋关节窝"
            },
            {
              "x": 50.7,
              "y": 79.53,
              "name": "臀折线"
            }
          ]
        },
        {
          "id": "fullbody-standing",
          "label": "全身·站立正面",
          "image": "images/20-fullbody-standing.jpeg",
          "w": 768,
          "h": 1024,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        },
        {
          "id": "fullbody-balance",
          "label": "全身·斜撑平衡",
          "image": "images/65-fullbody-balance.png",
          "w": 896,
          "h": 1190,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        }
      ]
    },
    {
      "id": "pelvis-hip",
      "name": "骨盆/髋",
      "views": [
        {
          "id": "pelvis-hip-landmarks",
          "label": "骨盆髋部标志",
          "image": "images/26-pelvis-hip-landmarks.jpeg",
          "w": 424,
          "h": 375,
          "editImage": "images/26-pelvis-hip-landmarks.jpeg",
          "editW": 424,
          "editH": 375,
          "practiceImage": "images/71-hip-study-sketch.png",
          "practiceW": 1104,
          "practiceH": 976,
          "practicePoints": [
            {
              "x": 39.26,
              "y": 34.62,
              "name": "脊柱沟"
            },
            {
              "x": 43.87,
              "y": 37.06,
              "name": "骶髂肌线"
            },
            {
              "x": 50.82,
              "y": 31.24,
              "name": "胸廓底边"
            },
            {
              "x": 50.55,
              "y": 40.72,
              "name": "髂结节"
            },
            {
              "x": 55.58,
              "y": 46.4,
              "name": "髂嵴"
            },
            {
              "x": 39.94,
              "y": 45.32,
              "name": "第五腰椎棘突"
            },
            {
              "x": 38.79,
              "y": 54.89,
              "name": "腰骶菱形窝"
            },
            {
              "x": 39.41,
              "y": 61.7,
              "name": "尾骨"
            },
            {
              "x": 39.03,
              "y": 71.77,
              "name": "臀沟"
            },
            {
              "x": 35.91,
              "y": 78.25,
              "name": "臀折线"
            },
            {
              "x": 44.53,
              "y": 48.53,
              "name": "髂后上棘"
            },
            {
              "x": 56.07,
              "y": 63.84,
              "name": "大转子"
            },
            {
              "x": 51.52,
              "y": 64.49,
              "name": "髋关节窝"
            }
          ],
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": [
            {
              "x": 36.93,
              "y": 31.81,
              "name": "脊柱沟"
            },
            {
              "x": 44.57,
              "y": 34.35,
              "name": "骶髂肌线"
            },
            {
              "x": 56.08,
              "y": 28.29,
              "name": "胸廓底边"
            },
            {
              "x": 55.63,
              "y": 38.17,
              "name": "髂结节"
            },
            {
              "x": 63.95,
              "y": 44.09,
              "name": "髂嵴"
            },
            {
              "x": 38.06,
              "y": 42.96,
              "name": "第五腰椎棘突"
            },
            {
              "x": 36.15,
              "y": 52.94,
              "name": "腰骶菱形窝"
            },
            {
              "x": 37.18,
              "y": 60.04,
              "name": "尾骨"
            },
            {
              "x": 36.55,
              "y": 70.53,
              "name": "臀沟"
            },
            {
              "x": 31.38,
              "y": 77.29,
              "name": "臀折线"
            },
            {
              "x": 45.65,
              "y": 46.31,
              "name": "髂后上棘"
            },
            {
              "x": 64.77,
              "y": 62.27,
              "name": "大转子"
            },
            {
              "x": 57.23,
              "y": 62.94,
              "name": "髋关节窝"
            }
          ]
        },
        {
          "id": "hip-muscles",
          "label": "髋臀肌群示意",
          "image": "images/38-hip-muscles.jpeg",
          "w": 1098,
          "h": 714,
          "crop": {
            "x": 0,
            "y": 0,
            "w": 100,
            "h": 100
          },
          "points": []
        }
      ]
    }
  ],
  "gallery": [
    {
      "file": "images/01-foot-top.jpeg",
      "title": "① 双脚·俯视 (足)"
    },
    {
      "file": "images/02-foot-side.jpeg",
      "title": "② 足背照片·有文字编辑图 (足)"
    },
    {
      "file": "images/03-hand-back.jpeg",
      "title": "③ 手背·照片 (手)"
    },
    {
      "file": "images/04-arms-knees.jpeg",
      "title": "④ 交叉手臂与膝 (上肢)"
    },
    {
      "file": "images/05-fullbody-female.jpeg",
      "title": "⑤ 全身女模·持剑 (综合)"
    },
    {
      "file": "images/06-hand-views.jpeg",
      "title": "⑥ 手部多视图 (手)"
    },
    {
      "file": "images/07-torso-sketch.jpeg",
      "title": "⑦ 躯干素描 (躯干)"
    },
    {
      "file": "images/08-torso-photo.jpeg",
      "title": "⑧ 躯干照片·正面 (躯干)"
    },
    {
      "file": "images/09-fullbody-sketch-run.jpeg",
      "title": "⑨ 全身素描·奔跑 (综合)"
    },
    {
      "file": "images/10-leg-photo.jpeg",
      "title": "⑩ 小腿照片 (下肢)"
    },
    {
      "file": "images/11-halfbody-sketch.jpeg",
      "title": "⑪ 半身素描·蹲 (综合)"
    },
    {
      "file": "images/12-thigh-sketch.jpeg",
      "title": "⑫ 大腿肌肉素描 (下肢)"
    },
    {
      "file": "images/13-arm-sketch.jpeg",
      "title": "⑬ 手臂肌肉素描 (上肢)"
    },
    {
      "file": "images/14-forearm-photo.jpeg",
      "title": "⑭ 前臂照片·彩色标注 (上肢)"
    },
    {
      "file": "images/15-fullbody-sketch-front.jpeg",
      "title": "⑮ 全身素描·奔跑 (综合)"
    },
    {
      "file": "images/16-hand-summary.jpeg",
      "title": "⑯ 手部结构点汇总 (手)"
    },
    {
      "file": "images/17-fullbody-squat.jpeg",
      "title": "⑰ 全身素描·蹲坐 (综合)"
    },
    {
      "file": "images/18-legs-back.jpeg",
      "title": "⑱ 全身素描·蹲坐 (综合)"
    },
    {
      "file": "images/19-back-linedrawing.jpeg",
      "title": "⑲ 全身素描·蹲坐(展腿) (综合)"
    },
    {
      "file": "images/20-fullbody-standing.jpeg",
      "title": "⑳ 全身素描·站立正面 (综合)"
    },
    {
      "file": "images/21-fullbody-squat2.jpeg",
      "title": "㉑ 背部结构·线描图 (背部)"
    },
    {
      "file": "images/22-model-color-run.jpeg",
      "title": "㉒ 男模彩色标注·奔跑 (综合)"
    },
    {
      "file": "images/23-model-color-side.jpeg",
      "title": "㉓ 男模彩色标注·侧面 (综合)"
    },
    {
      "file": "images/25-shoulder-clavicle.jpeg",
      "title": "㉕ 锁骨肩带 (上肢)"
    },
    {
      "file": "images/26-pelvis-hip-landmarks.jpeg",
      "title": "㉖ 骨盆髋部标志 (骨盆/髋)"
    },
    {
      "file": "images/27-torso-shoulder-chest.jpeg",
      "title": "㉗ 肩胸正面标志 (躯干)"
    },
    {
      "file": "images/28-foot-side-bone.jpeg",
      "title": "㉘ 足侧面骨性标志 (足)"
    },
    {
      "file": "images/29-forearm-bone.jpeg",
      "title": "㉙ 前臂骨性标志·编辑原图 (上肢)"
    },
    {
      "file": "images/30-hand-wrist-small.jpeg",
      "title": "㉚ 手腕小图 (手)"
    },
    {
      "file": "images/31-lowerleg-medial-ankle.jpeg",
      "title": "㉛ 小腿内侧/足踝 (下肢)"
    },
    {
      "file": "images/32-upperlimb-flexed.jpeg",
      "title": "㉜ 屈肘上肢照片 (上肢)"
    },
    {
      "file": "images/33-lowerleg-front.jpeg",
      "title": "㉝ 小腿正面 (下肢)"
    },
    {
      "file": "images/34-foot-dorsum-tendons.jpeg",
      "title": "㉞ 足背肌腱彩色图 (足)"
    },
    {
      "file": "images/35-foot-bone-landmarks.jpeg",
      "title": "㉟ 足骨标志图 (足)"
    },
    {
      "file": "images/36-lowerlimb-muscle-sketch.jpeg",
      "title": "㊱ 下肢肌肉素描 (下肢)"
    },
    {
      "file": "images/37-lowerlimb-muscle-color.jpeg",
      "title": "㊲ 下肢肌肉彩色图 (下肢)"
    },
    {
      "file": "images/38-hip-muscles.jpeg",
      "title": "㊳ 髋臀肌群示意 (骨盆/髋)"
    },
    {
      "file": "images/39-hand-views-practice.jpeg",
      "title": "㊴ 手部多视图·编辑原图 (手)"
    },
    {
      "file": "images/40-torso-shoulder-practice.jpeg",
      "title": "㊵ 颈肩胸·旧编辑参考图 (躯干)"
    },
    {
      "file": "images/41-foot-dorsum-practice.jpeg",
      "title": "㊶ 足背照片·编辑原图 (足)"
    },
    {
      "file": "images/42-hand-pose-practice.jpeg",
      "title": "㊷ 手势照片·旧编辑参考图 (手)"
    },
    {
      "file": "images/44-lowerleg-medial-practice.jpeg",
      "title": "㊹ 小腿内侧·旧编辑参考图 (下肢)"
    },
    {
      "file": "images/45-foot-bone-practice.jpeg",
      "title": "㊺ 足骨线稿·旧编辑参考图 (足)"
    },
    {
      "file": "images/46-upperlimb-flexed-practice.jpeg",
      "title": "㊻ 屈肘上肢·旧编辑参考图 (上肢)"
    },
    {
      "file": "images/47-hand-views-learn.jpeg",
      "title": "㊼ 手部多视图·学习测试图 (手)"
    },
    {
      "file": "images/48-torso-shoulder-learn.jpeg",
      "title": "㊽ 颈肩胸·学习测试图 (躯干)"
    },
    {
      "file": "images/49-foot-dorsum-learn.jpeg",
      "title": "㊾ 足背照片·学习测试图 (足)"
    },
    {
      "file": "images/50-hand-pose-learn.jpeg",
      "title": "㊿ 手势照片·学习测试图 (手)"
    },
    {
      "file": "images/52-lowerleg-medial-learn.jpeg",
      "title": "52 小腿内侧·学习测试图 (下肢)"
    },
    {
      "file": "images/53-foot-bone-learn.jpeg",
      "title": "53 足骨线稿·学习测试图 (足)"
    },
    {
      "file": "images/54-upperlimb-flexed-learn.jpeg",
      "title": "54 屈肘上肢·学习测试图 (上肢)"
    },
    {
      "file": "images/55-lowerleg-front-learn.jpeg",
      "title": "55 小腿正面·学习测试图 (下肢)"
    },
    {
      "file": "images/56-forearm-bone-learn.jpeg",
      "title": "56 前臂骨性标志·学习测试图 (上肢)"
    },
    {
      "file": "images/57-torso-front-class.jpeg",
      "title": "57 躯干正面课堂标注 (躯干)"
    },
    {
      "file": "images/58-lowerleg-front-class.jpeg",
      "title": "58 小腿正面课堂标注 (下肢)"
    },
    {
      "file": "images/60-lowerleg-side-class.jpeg",
      "title": "60 小腿侧后课堂标注 (下肢)"
    },
    {
      "file": "images/61-torso-front-class-learn-v2.png",
      "title": "61 躯干正面课堂学习图 (躯干)"
    },
    {
      "file": "images/62-lowerleg-side-class-learn.jpeg",
      "title": "62 小腿侧后课堂学习图 (下肢)"
    },
    {
      "file": "images/63-lowerleg-front-class-learn-v2.png",
      "title": "63 小腿正面课堂学习图 (下肢)"
    },
    {
      "file": "images/64-hand-views-edit.jpeg",
      "title": "64 手部多视图标注原图 (手)"
    },
    {
      "file": "images/65-fullbody-balance.png",
      "title": "65 全身男模·斜撑平衡 (综合)"
    }
  ]
};
